; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v10 ?v4)
             (pred_1 ?v7 ?v8)
             (pred_9 ?v10 ?v8)
             (pred_10 ?v9 ?v10 )
	     (pred_5 ?v10)
             (pred_12 ?v1)
             (pred_6 ?v7)
             (pred_8 ?v8)
             (pred_2 ?v10)
             (pred_7 ?v7)
             (pred_11 ?v10)
             (pred_3 ))



(:action op_5
:parameters (?v13 ?v6 ?v12 ?v11)
:precondition (and (pred_12 ?v13) (pred_12 ?v6) (pred_6 ?v12) (pred_8 ?v11)
          (pred_4 ?v13 ?v6) (pred_1 ?v12 ?v11)
                   (pred_9 ?v6 ?v11) (pred_5 ?v13) 
                   (pred_2 ?v6) (pred_7 ?v12))
:effect (and  (pred_11 ?v6) (not (pred_2 ?v6))))


(:action op_2
:parameters (?v13 ?v5)
:precondition (and (pred_12 ?v13) (pred_12 ?v5)
               (pred_5 ?v13) (pred_4 ?v13 ?v5) (pred_11 ?v5))
:effect (and (pred_5 ?v5) (not (pred_5 ?v13))))

(:action op_1
:parameters (?v13 ?v12)
:precondition (and (pred_12 ?v13) (pred_6 ?v12) 
                  (pred_5 ?v13) (pred_10 ?v12 ?v13) (pred_3 ))
:effect (and (pred_7 ?v12)
   (not (pred_10 ?v12 ?v13)) (not (pred_3 ))))


(:action op_4
:parameters (?v13 ?v2 ?v3)
:precondition (and (pred_12 ?v13) (pred_6 ?v2) (pred_6 ?v3)
                  (pred_5 ?v13) (pred_7 ?v3) (pred_10 ?v2 ?v13))
:effect (and (pred_7 ?v2) (pred_10 ?v3 ?v13)
        (not (pred_7 ?v3)) (not (pred_10 ?v2 ?v13))))

(:action op_3
:parameters (?v13 ?v12)
:precondition (and (pred_12 ?v13) (pred_6 ?v12) 
                  (pred_5 ?v13) (pred_7 ?v12))
:effect (and (pred_3 ) (pred_10 ?v12 ?v13) (not (pred_7 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_19 obj_07 obj_01 obj_03 obj_16 obj_06 obj_04 obj_14 obj_17 obj_02 obj_12 obj_20 obj_15 obj_08 obj_05
    obj_18 obj_13
    obj_11 obj_09
    )

    (:init
       (pred_3)

       (pred_12 obj_10)
       (pred_12 obj_19)
       (pred_12 obj_07)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_16)
       (pred_12 obj_06)
       (pred_12 obj_04)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_02)
       (pred_12 obj_12)
       (pred_12 obj_20)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_05)
       (pred_8 obj_18)
       (pred_8 obj_13)
       (pred_6 obj_11)
       (pred_6 obj_09)

       (pred_4 obj_10 obj_03)
       (pred_4 obj_10 obj_19)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_19 obj_07)
       (pred_4 obj_19 obj_10)
       (pred_4 obj_07 obj_06)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_07 obj_19)
       (pred_4 obj_01 obj_04)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_03 obj_14)
       (pred_4 obj_03 obj_16)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_16 obj_17)
       (pred_4 obj_16 obj_06)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_16 obj_03)
       (pred_4 obj_06 obj_02)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_07)
       (pred_4 obj_06 obj_16)
       (pred_4 obj_04 obj_12)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_14 obj_17)
       (pred_4 obj_14 obj_03)
       (pred_4 obj_17 obj_15)
       (pred_4 obj_17 obj_02)
       (pred_4 obj_17 obj_16)
       (pred_4 obj_17 obj_14)
       (pred_4 obj_02 obj_08)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_02 obj_06)
       (pred_4 obj_02 obj_17)
       (pred_4 obj_12 obj_05)
       (pred_4 obj_12 obj_04)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_20 obj_15)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_15 obj_08)
       (pred_4 obj_15 obj_17)
       (pred_4 obj_15 obj_20)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_08 obj_02)
       (pred_4 obj_08 obj_15)
       (pred_4 obj_05 obj_12)
       (pred_4 obj_05 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_08)
       (pred_9  obj_12 obj_18)
       (pred_9  obj_08 obj_13)
       (pred_11 obj_10)
       (pred_11 obj_19)
       (pred_11 obj_07)
       (pred_11 obj_01)
       (pred_11 obj_03)
       (pred_11 obj_16)
       (pred_11 obj_06)
       (pred_11 obj_04)
       (pred_11 obj_14)
       (pred_11 obj_17)
       (pred_11 obj_02)
       (pred_11 obj_20)
       (pred_11 obj_15)
       (pred_11 obj_05)

       (pred_1  obj_11 obj_18)
       (pred_1  obj_09 obj_13)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_09 obj_01)
       (pred_5 obj_20)
    )

    (:goal (and
       (pred_10 obj_11 obj_10)
    ))
(:constraints
  (always (not (pred_5 obj_17)))
)
)

; plan
1. (op_2 obj_20 obj_14)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_14)
   goals met: 0 of 1
2. (op_2 obj_14 obj_03)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_03)
   goals met: 0 of 1
3. (op_2 obj_03 obj_16)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_16)
   goals met: 0 of 1
4. (op_2 obj_16 obj_06)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_06)
   goals met: 0 of 1
5. (op_2 obj_06 obj_02)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_02)
   goals met: 0 of 1
6. (op_1 obj_02 obj_11)
   deleted: (pred_10 obj_11 obj_02) (pred_3)
   added: (pred_7 obj_11)
   goals met: 0 of 1
7. (op_2 obj_02 obj_06)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_06)
   goals met: 0 of 1
8. (op_2 obj_06 obj_07)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_07)
   goals met: 0 of 1
9. (op_2 obj_07 obj_19)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_19)
   goals met: 0 of 1
10. (op_2 obj_19 obj_10)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_10)
   goals met: 0 of 1
11. (op_3 obj_10 obj_11)
   deleted: (pred_7 obj_11)
   added: (pred_3) (pred_10 obj_11 obj_10)
   goals met: 1 of 1
